In [1]:
import gspread
import pandas as pd
import pymysql.cursors

from sqlalchemy import create_engine

In [2]:
import MySQLdb as db

In [3]:
service_account = gspread.service_account(filename="/Users/timal/.config/gspread/service_account.json")

In [ ]:
# M0 MONEY SUPPLY

In [4]:
sheet = service_account.open("base_money_supply")
work_sheet = sheet.worksheet("FRED Graph")

In [5]:
all_values = work_sheet.get_all_values()
df = pd.DataFrame(all_values)

In [6]:
df = df.loc[10:]

In [7]:
df.rename(columns=df.iloc[0], inplace = True)
df.drop(df.index[0], inplace = True)
# df['base_money']
df
# df['base_money'] = df['base_money'].apply(lambda x: x * 1000000)

    observation_date base_money
11        1959-01-01      50500
12        1959-02-01      49800
13        1959-03-01      49700
14        1959-04-01      50100
15        1959-05-01      50100
..               ...        ...
766       2021-12-01    6413100
767       2022-01-01    6103900
768       2022-02-01    6040000
769       2022-03-01    6134500
770       2022-04-01    5885200

[760 rows x 2 columns]

In [8]:
df.insert(2, 'scale', 'Millions')

In [9]:
df

    observation_date base_money     scale
11        1959-01-01      50500  Millions
12        1959-02-01      49800  Millions
13        1959-03-01      49700  Millions
14        1959-04-01      50100  Millions
15        1959-05-01      50100  Millions
..               ...        ...       ...
766       2021-12-01    6413100  Millions
767       2022-01-01    6103900  Millions
768       2022-02-01    6040000  Millions
769       2022-03-01    6134500  Millions
770       2022-04-01    5885200  Millions

[760 rows x 3 columns]

In [10]:
df['base_money'] = pd.to_numeric(df['base_money'])

In [11]:
df['observation_date'][11]

'1959-01-01'

In [12]:
df['observation_date'] = pd.to_datetime(df['observation_date'], format='%Y/%m/%d')

In [13]:
df['observation_date'][11]

Timestamp('1959-01-01 00:00:00')

In [15]:
mysql_url = 'mysql://root:root@localhost/macro_data'

engine = create_engine(mysql_url, echo=True)
mysql_connection = engine.connect()
# mysql_connection = pymysql.connect(host='localhost',
#                                    user='root',
#                                    password='root',
#                                    db='macro_data',
#                                    cursorclass=pymysql.cursors.DictCursor)

df[['observation_date','base_money', 'scale']].to_sql(con=mysql_connection, name='us_monthly_base_money_supply', if_exists = 'replace', index=False)

2022-06-07 09:35:38,352 INFO sqlalchemy.engine.Engine SELECT DATABASE()
2022-06-07 09:35:38,355 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-06-07 09:35:38,359 INFO sqlalchemy.engine.Engine SELECT @@sql_mode
2022-06-07 09:35:38,360 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-06-07 09:35:38,361 INFO sqlalchemy.engine.Engine SELECT @@lower_case_table_names
2022-06-07 09:35:38,361 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-06-07 09:35:38,378 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %s AND table_name = %s
2022-06-07 09:35:38,379 INFO sqlalchemy.engine.Engine [generated in 0.00078s] ('macro_data', 'us_monthly_base_money_supply')
2022-06-07 09:35:38,399 INFO sqlalchemy.engine.Engine SELECT COUNT(*) FROM information_schema.tables WHERE table_schema = %s AND table_name = %s
2022-06-07 09:35:38,399 INFO sqlalchemy.engine.Engine [cached since 0.02152s ago] ('macro_data', 'us_monthly_base_money_supply')
2022-06-07 09:35:38,402 INFO sqlalchemy.engine.Engine SHOW FULL TABLES FROM `macro_data`
2022-06-07 09:35:38,403 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-06-07 09:35:38,420 INFO sqlalchemy.engine.Engine SHOW CREATE TABLE `us_monthly_base_money_supply`
2022-06-07 09:35:38,420 INFO sqlalchemy.engine.Engine [raw sql] ()
2022-06-07 09:35:38,443 INFO sqlalchemy.engine.Engine
DROP TABLE us_monthly_base_money_supply
2022-06-07 09:35:38,443 INFO sqlalchemy.engine.Engine [no key 0.00062s] ()
2022-06-07 09:35:38,454 INFO sqlalchemy.engine.Engine COMMIT
2022-06-07 09:35:38,456 INFO sqlalchemy.engine.Engine
CREATE TABLE us_monthly_base_money_supply (
	observation_date DATETIME,
	base_money BIGINT,
	scale TEXT
)


2022-06-07 09:35:38,456 INFO sqlalchemy.engine.Engine [no key 0.00046s] ()
2022-06-07 09:35:38,477 INFO sqlalchemy.engine.Engine COMMIT
2022-06-07 09:35:38,484 INFO sqlalchemy.engine.Engine INSERT INTO us_monthly_base_money_supply (observation_date, base_money, scale) VALUES (%s, %s, %s)
2022-06-07 09:35:38,484 INFO sqlalchemy.engine.Engine [generated in 0.00257s] ((datetime.datetime(1959, 1, 1, 0, 0), 50500, 'Millions'), (datetime.datetime(1959, 2, 1, 0, 0), 49800, 'Millions'), (datetime.datetime(1959, 3, 1, 0, 0), 49700, 'Millions'), (datetime.datetime(1959, 4, 1, 0, 0), 50100, 'Millions'), (datetime.datetime(1959, 5, 1, 0, 0), 50100, 'Millions'), (datetime.datetime(1959, 6, 1, 0, 0), 50300, 'Millions'), (datetime.datetime(1959, 7, 1, 0, 0), 50800, 'Millions'), (datetime.datetime(1959, 8, 1, 0, 0), 50700, 'Millions')  ... displaying 10 of 760 total bound parameter sets ...  (datetime.datetime(2022, 3, 1, 0, 0), 6134500, 'Millions'), (datetime.datetime(2022, 4, 1, 0, 0), 5885200, 'Millions'))
2022-06-07 09:35:38,509 INFO sqlalchemy.engine.Engine COMMIT

760

In [ ]:
# M1 Money Supply